_posts/2021-09-12-abc218-d-upsolving.html
---
title: D - Rectangles
tags: AtCoder
toc: true
toc_sticky: true
---

<div id="outline-container-orgfe6ecb3" class="outline-2">
<h2 id="orgfe6ecb3">D - Rectangles</h2>
<div class="outline-text-2" id="text-orgfe6ecb3">
<ul class="org-ul">
<li>조건에 맞는 사각형의 개수를 구하는 문제</li>
</ul>
</div>
</div>

<div id="outline-container-orgd34917a" class="outline-2">
<h2 id="orgd34917a">접근하기</h2>
<div class="outline-text-2" id="text-orgd34917a">
<ul class="org-ul">
<li>사각형의 성질을 알아야 풀 수 있는 문제</li>
<li>N &lt;= 2000이므로, 2000*2000=40000000, 4백만으로 이중 for loop까지는 가능할 것.</li>
<li>Editorial에서는 sort 후 binsearch를 통해 최적화함</li>
</ul>
</div>
</div>

<div id="outline-container-orgfe392cb" class="outline-2">
<h2 id="orgfe392cb">코드</h2>
<div class="outline-text-2" id="text-orgfe392cb">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span> {
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">y</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">x</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">a</span>[2020];

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">comp</span>(<span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p2</span>) <span style="color: #888a85;">// </span><span style="color: #888a85;">sort&#50640; &#49324;&#50857;&#46104;&#45716; compare</span>
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (p1.x == p2.x)
    {
        <span style="color: #729fcf; font-weight: bold;">return</span> (p1.y &lt; p2.y);
    } <span style="color: #729fcf; font-weight: bold;">else</span> {
        <span style="color: #729fcf; font-weight: bold;">return</span> (p1.x &lt; p2.x);
    }
}

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">comp2</span>(<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">p2</span>) <span style="color: #888a85;">// </span><span style="color: #888a85;">binary search&#50640; &#49324;&#50857;&#46104;&#45716; compare</span>
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (p1.x == p2.x)
    {
        <span style="color: #729fcf; font-weight: bold;">return</span> (p1.y &lt; p2.y);
    } <span style="color: #729fcf; font-weight: bold;">else</span> {
        <span style="color: #729fcf; font-weight: bold;">return</span> (p1.x &lt; p2.x);
    }
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;a[i].x, &amp;a[i].y);
    }
    sort(a, a+N, comp);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cnt</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=i+1;j&lt;N;j++) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (a[i].x &lt; a[j].x &amp;&amp; a[i].y &lt; a[j].y) {
                <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">tmp1</span>;
                tmp1.x = a[i].x;
                tmp1.y = a[j].y;
                <span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #ff6347;">cond1</span> = binary_search(a, a+N, tmp1, comp2);

                <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">tmp2</span>;
                tmp2.x = a[j].x;
                tmp2.y = a[i].y;
                <span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #ff6347;">cond2</span> = binary_search(a, a+N, tmp2, comp2);

                <span style="color: #729fcf; font-weight: bold;">if</span> (cond1 &amp;&amp; cond2)
                    cnt++;
            }
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, cnt);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<ul class="org-ul">
<li>181ms 걸림</li>
</ul>
</div>
</div>

<div id="outline-container-orgea86a2f" class="outline-2">
<h2 id="orgea86a2f"><span class="todo TODO">TODO</span> 최적 풀이 분석</h2>
<div class="outline-text-2" id="text-orgea86a2f">
<ul class="org-ul">
<li>20ms 이내의 최적 풀이가 있음</li>
</ul>
</div>
</div>

<div id="outline-container-org77a1ed9" class="outline-2">
<h2 id="org77a1ed9">주의할 점</h2>
<div class="outline-text-2" id="text-org77a1ed9">
<ul class="org-ul">
<li>STL pair를 쓰지 않을 때, compare함수가 first, second값을 모두 compare해줘야 한다.</li>
</ul>
</div>
</div>

<div id="outline-container-org97a96ba" class="outline-2">
<h2 id="org97a96ba">문제 링크</h2>
<div class="outline-text-2" id="text-org97a96ba">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc218/tasks/abc218_d">https://atcoder.jp/contests/abc218/tasks/abc218_d</a></li>
</ul>
</div>
</div>
